<script lang="ts">
import { Component, Vue } from "nuxt-property-decorator";

@Component({
  components: {}
})

export default class extends Vue {
  isOpen = false;
  contentRef: HTMLElement | undefined;
  contentMaxHeight: number = 0;

  mounted() {
    this.contentRef = this.$refs.textContent as HTMLElement;
    this.contentMaxHeight = this.contentRef.clientHeight;
  }
};
</script>

<style lang="scss" scoped>
@import 'about-what';
</style>

<template>
  <div class="container">
    <div class="gl-caption">
      О чём это вообще?
    </div>

    <div
      class="text-container"
      :class="{ 'mod-open': isOpen }"
      :style="{ maxHeight: isOpen ? `${ contentMaxHeight }px` : '120px' }"
    >
      <div class="text-content" ref="textContent">
        <p class="text">
          Стихотворение «Туча» было написано в волнительный для поэта период. Он ожидал ответа по поводу ходатайства о
          разрешении издавать газету, и все свои переживания и надежды, что «тучи рассеются», отобразил в стихотворных
          строках.
        </p>
        <p class="text">
          Стихотворение относится к пейзажной лирике.
        </p>
        <p class="text">
          Центральная тема стихотворения – душевные переживания, волнения лирического героя, которые нашли отклик в
          природе. Под тучей подразумевается человек, на долю которого выпало немало испытаний, однако все его печали и
          заботы позади – чёрная полоса миновала, уступив место надеждам на спокойную, счастливую жизнь.
        </p>
        <p class="text">
          Производя анализ стихотворения «Туча» Пушкина, следует отметить, что композиционно произведение делится на три
          части по количеству четверостиший. Оно построено на антитезе – недавняя сильная буря противопоставлена
          наступившему покою.
        </p>
        <p class="text">
          Стихотворный размер – четырехстопный амфибрахий с парным чередованием мужских и женских рифм. Благодаря этому
          приёму создаётся плавный, успокаивающий ритм повествования.
        </p>
        <p class="text">
          Произведение написано в жанре лирического стихотворения: основное – мысли и чувства лирического героя,
          лирическое начало.
        </p>
        <p class="text">
          Поэт использует разнообразные художественные средства, с помощью которых передает настроение лирического героя
          Эпитеты («унылая», «рассеянная», «таинственный», «алчная»), метафоры («алчную землю поила дождём», «несёшься
          по ясной лазури») и олицетворения («земля освежилась», «буря промчалась», «ветер гонит») делают стих богаче,
          ярче.
        </p>
      </div>
    </div>

    <button
      type="button"
      class="btn-more"
      @click="isOpen = !isOpen"
    >
      <span v-if="isOpen">
        Я всё понял
      </span>
      <span v-else>
        Почитаю ещё
      </span>
    </button>
  </div>
</template>
